app/controllers/transactions_controller.rb

SELECT * FROM "tags"
SELECT * FROM "transactions" WHERE ("transactions".statement_id = 1)
---
  def index
    # get an ordered list of tags
    @tags = Tag.find(:all, :order => 'name')
    # add a dummy tag to the array so untagged transactions will
    # also be shown
    # bit of a hack as this throws a warning - might be better to
    # split transaction/index view into a partial and treat untagged
    # as a special case
    @tags << Tag.new(:name => 'untagged', :id=>nil)
    # get all transactions in an array, by tag
    # untagged transactions have a key of nil
    @grouped_transactions = Transaction.group_by_tags

SELECT * FROM "transactions" WHERE ("transactions"."id" = 12)
---
  def show
    @transaction = Transaction.find(params[:id])

INSERT INTO "transactions" ("created_at", "updated_at", "amount", "text", "statement_id", "date") VALUES('2010-01-24 10:11:22', '2010-01-24 10:11:22', 10.0, 'dsf', 1, '2010-01-24')
---
  def create
    @transaction = Transaction.new(params[:transaction])
    @transaction.statement_id = 1
    tagid = params[:transaction].delete('tag_id')
    if @transaction.save and @transaction.assign_tag(tagid, 1)

SELECT * FROM "transactions" WHERE ("transactions"."id" = 1)
---
  def edit
    @transaction = Transaction.find(params[:id])

SELECT * FROM "transactions" WHERE ("transactions"."id" = 0)
UPDATE "transactions" SET "updated_at" = '2010-01-24 23:18:14', "amount" = 53.0, "text" = 'Ft' WHERE "id" = 12
---
  def update
    @transaction = Transaction.find(params[:id])
    tagid = params[:transaction].delete('tag_id')
    if @transaction.update_attributes(params[:transaction]) and

SELECT * FROM "transactions" WHERE ("transactions"."id" = 16)
DELETE FROM "transactions" WHERE "id" = 16
---
  def destroy
    @transaction = Transaction.find(params[:id])
    @transaction.destroy